fn main() {

//-------------------- f32 실수형 변수 예제 --------------------//
    let a: f32 = 6f32;
    let b: f32 = 4.0;
    // f32형 변수에 정수값을 할당할 수 없다.
    // let b: f32 = 4;
    // 자료형이 서로 다를 경우 연산을 할 수 없다.
    // let b: f64 = 4.0;
    let c = a + b;

    println!("{a} + {b} = {c}");

//-------------------- f64 실수형 변수 예제 --------------------//
    let a: f64 = 6f64;
    let b: f64 = 4.0;
    // 자료형이 서로 다를 경우 연산을 할 수 없다.
    // let b: f32 = 4.0;
    let c = a + b;

    println!("{a} + {b} = {c}");
}